InformationRegisters/ПравилаИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПравилаИспользования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравилИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПравилаИспользования/Ext/ManagerModule.bsl
Процедура ПолучитьПравилаИспользования(Ссылка, ОписаниеТипов, Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// Деревов правил использования.
	ПравилаИспользования = Новый ДеревоЗначений;
	ПравилаИспользования.Колонки.Добавить("ОбъектИспользования", ОписаниеТипов);
	ПравилаИспользования.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"), "Представление");
	ПравилаИспользования.Колонки.Добавить("Актуальность", Новый ОписаниеТипов("Булево"), "Актуальность");
	ПравилаИспользования.Колонки.Добавить("ТолькоПросмотр", Новый ОписаниеТипов("Булево"), "Только просмотр");
	ПравилаИспользования.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число"), "Картинка");
	
	// Заполнение данных.
	Для Каждого ДопустимыйТипы Из ОписаниеТипов.Типы() Цикл

		ОбъектМетаданных = Метаданные.НайтиПоТипу(ДопустимыйТипы);
		
		// Запрос.
		Если ОбъектМетаданных.Владельцы.Количество() Тогда
			Подчиненный = Истина;
			
			Если ОбъектМетаданных.Иерархический Тогда
				Если (ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда
					ТекстЗапроса = "ВЫБРАТЬ
					               |	Меню.Владелец,
					               |	Меню.Владелец.Представление КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК ОбъектИспользования,
					               |	Меню.Представление,
					               |	ЕСТЬNULL(ПравилаИспользования.Актуальность, ИСТИНА) КАК Актуальность,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
					               |		ПО (ПравилаИспользования.ОбъектИспользования = Меню.Ссылка)
					               |			И (ПравилаИспользования.ВладелецПравилИспользования = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	Меню.Владелец,
					               |	Меню.Владелец.Представление КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК ОбъектИспользования,
					               |	Меню.Представление,
					               |	ЕСТЬNULL(ПравилаИспользования.Актуальность, ИСТИНА) КАК Актуальность,
					               |	ВЫБОР
					               |		КОГДА Меню.ЭтоГруппа
					               |			ТОГДА 2
					               |		ИНАЧЕ 0
					               |	КОНЕЦ + ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
					               |		ПО (ПравилаИспользования.ОбъектИспользования = Меню.Ссылка)
					               |			И (ПравилаИспользования.ВладелецПравилИспользования = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				КонецЕсли;
			Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	Меню.Владелец,
					               |	Меню.Владелец.Представление КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК ОбъектИспользования,
					               |	Меню.Представление,
					               |	ЕСТЬNULL(ПравилаИспользования.Актуальность, ИСТИНА) КАК Актуальность,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
					               |		ПО (ПравилаИспользования.ОбъектИспользования = Меню.Ссылка)
					               |			И (ПравилаИспользования.ВладелецПравилИспользования = &Владелец)
					               |АВТОУПОРЯДОЧИВАНИЕ";
			КонецЕсли;
		Иначе
			Подчиненный = Ложь;
			
			Если (ОбъектМетаданных.Иерархический) Тогда
				Если (ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда
					ТекстЗапроса = "ВЫБРАТЬ
					               |	НЕОПРЕДЕЛЕНО КАК Владелец,
					               |	НЕОПРЕДЕЛЕНО КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК ОбъектИспользования,
					               |	Меню.Представление,
					               |	ЕСТЬNULL(ПравилаИспользования.Актуальность, ИСТИНА) КАК Актуальность,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
					               |		ПО (ПравилаИспользования.ОбъектИспользования = Меню.Ссылка)
					               |			И (ПравилаИспользования.ВладелецПравилИспользования = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	НЕОПРЕДЕЛЕНО КАК Владелец,
					               |	НЕОПРЕДЕЛЕНО КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК ОбъектИспользования,
					               |	Меню.Представление,
					               |	ЕСТЬNULL(ПравилаИспользования.Актуальность, ИСТИНА) КАК Актуальность,
					               |	ВЫБОР
					               |		КОГДА Меню.ЭтоГруппа
					               |			ТОГДА 2
					               |		ИНАЧЕ 0
					               |	КОНЕЦ + ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
					               |		ПО (ПравилаИспользования.ОбъектИспользования = Меню.Ссылка)
					               |			И (ПравилаИспользования.ВладелецПравилИспользования = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				КонецЕсли;
			Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	НЕОПРЕДЕЛЕНО КАК Владелец,
					               |	НЕОПРЕДЕЛЕНО КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК ОбъектИспользования,
					               |	Меню.Представление,
					               |	ЕСТЬNULL(ПравилаИспользования.Актуальность, ИСТИНА) КАК Актуальность,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
					               |		ПО (ПравилаИспользования.ОбъектИспользования = Меню.Ссылка)
					               |			И (ПравилаИспользования.ВладелецПравилИспользования = &Владелец)
					               |АВТОУПОРЯДОЧИВАНИЕ";
			КонецЕсли;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Меню", "Справочник." + ОбъектМетаданных.Имя);
	
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Владелец", Ссылка.Ссылка);
		
		ПромежуточныйРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		// Нисходящий обход дерева.
		КорневойРодитель = ПравилаИспользования.Строки.Добавить();
		КорневойРодитель.Представление = ОбъектМетаданных.Синоним;
		КорневойРодитель.ОбъектИспользования = Справочники[ОбъектМетаданных.Имя].ПустаяСсылка();
		КорневойРодитель.ТолькоПросмотр = Истина;
		КорневойРодитель.ИндексКартинки = 5;
		КорневойРодитель = КорневойРодитель.Строки;
		
		СоответсвиеРодителей = Новый Соответствие; МассивПодчиненных = Новый Массив; МассивПодчиненных.Добавить(ПромежуточныйРезультат.Строки);

		Для Каждого РодительЭлементы Из МассивПодчиненных Цикл
			Для Каждого ПодчиненныеДанные Из РодительЭлементы Цикл
				
				Если (ПодчиненныеДанные.Родитель = Неопределено) Тогда
					Если Подчиненный Тогда
						ВладелецРодитель = СоответсвиеРодителей[ПодчиненныеДанные.Владелец];
						
						Если (ВладелецРодитель = Неопределено) Тогда
							ВладелецРодитель = КорневойРодитель.Добавить();
							ВладелецРодитель.Представление = ПодчиненныеДанные.ВладелецПредставление;
							ВладелецРодитель.ОбъектИспользования = ПодчиненныеДанные.Владелец;
							ВладелецРодитель.ТолькоПросмотр = Истина;
							ВладелецРодитель.ИндексКартинки = 4;
							ВладелецРодитель = ВладелецРодитель.Строки;
							
							СоответсвиеРодителей[ПодчиненныеДанные.Владелец] = ВладелецРодитель;
						КонецЕсли; 
						
						СтрокаДанных = ВладелецРодитель.Добавить();
					Иначе
						СтрокаДанных = КорневойРодитель.Добавить();
					КонецЕсли; 
				Иначе
					СтрокаДанных = СоответсвиеРодителей[ПодчиненныеДанные.Родитель].Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтрокаДанных, ПодчиненныеДанные);
				
				ПодчиненныеДанныеЭлементы = ПодчиненныеДанные.Строки; 
				Если ПодчиненныеДанныеЭлементы.Количество() Тогда
					МассивПодчиненных.Добавить(ПодчиненныеДанныеЭлементы);
					СоответсвиеРодителей[ПодчиненныеДанные] = СтрокаДанных.Строки;
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
			
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ПравилаИспользования, Объект);	

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПолучитьПравилаИспользования()

Процедура УстановитьПравилаИспользования(Ссылка, Объект, Отказ) Экспорт

	Если Не Отказ Тогда

		УстановитьПривилегированныйРежим(Истина);
		
		ПравилаИспользования = ДанныеФормыВЗначение(Объект, Тип("ДеревоЗначений"));
		
		НаборЗаписей = РегистрыСведений.ПравилаИспользования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВладелецПравилИспользования.Установить(Ссылка.Ссылка);
		
		// Актуальные.
		Для Каждого СтрокаПравилИспользования Из ПравилаИспользования.Строки.НайтиСтроки(Новый Структура("Актуальность,ТолькоПросмотр", Ложь, Ложь), Истина) Цикл 
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаПравилИспользования);
			Запись.ВладелецПравилИспользования = Ссылка.Ссылка;
		КонецЦикла; 

		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			// ERR
			Отказ = Истина;
		КонецПопытки;

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьПравилаИспользования()
